app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("title", "author", "subject", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dfgbtdbhn"], ["author", "rghrgh"], ["subject", "rfh"], ["user_id", 41], ["created_at", "2017-12-06 14:54:45.187416"], ["updated_at", "2017-12-06 14:54:45.187416"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user.user

    respond_to do |format|
      if @post.save