app/controllers/api/users_controller.rb

  def index
    # If the REST client wants everything using the all query
    # parameter, then give it everything!
    if params.key?(:all)
      @users = User.all.order('surname, firstname')
---
SELECT "users".* FROM "users" ORDER BY surname, firstname