app/views/notifications/_notification.html.erb

      <a href="<%= user_path(notification.user.id) %>">
        <%= notification.user.firstname %> <%= notification.user.surname %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]