app/controllers/broadcasts_controller.rb

  def index
    @broadcasts = Broadcast.paginate(page: params[:page],
                                     per_page: params[:per_page])
                      .order('created_at DESC')
---
SELECT  "broadcasts".* FROM "broadcasts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "broadcasts"