app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user.user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "author", "subject", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["author", "test"], ["subject", "test"], ["user_id", 41], ["created_at", "2017-11-29 13:38:48.434117"], ["updated_at", "2017-11-29 13:38:48.434117"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "author" = ?, "subject" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["author", "admin"], ["subject", "trewst1"], ["updated_at", "2017-11-29 13:49:57.588749"], ["id", 5]]